Repository: carlosgutierrezlopez/Simula3MS-Swift
Catalog: Localizable.xcstrings
Source language: en
Languages: ar, br, cs, cy, da, de, el, es, et, fa, fi, fr, ga, gd, gl, he, hi, hr, it, ja, ko, kw, lt, lv, nb, nl, pl, pt_pt, ro, sv, uk, zh_hans

# guide.body
source: This guide summarizes the basic steps to start working with Simula3MS. 1. Once the Simula3MS window is open, there are two options: • Load a file that was previously edited. • Edit new code in assembly language. 2. After editing or loading the file, the next step is to assemble it by pressing the Assemble button. From here there are two possible outcomes: • If the code has no syntax errors, the Run button is enabled to open the simulation window. • If the code is not correct, the bottom area of the window shows the full error list and the first one appears highlighted. You can move through the remaining ones, if any, with the Next error button. After fixing the errors, press Assemble again and repeat step 2. 3. Choose the execution configuration. There are three options in the Settings menu: Input/Output, Datapath, and branch techniques. • Input/Output. I/O is disabled by default. You can choose polling I/O or interrupt-based I/O. • Datapath. The default option is Single-cycle. If you select Multi-cycle or any pipelined implementation, a new window opens to configure floating-point operation latency. • Branch techniques. Simula3MS currently allows two branch techniques: delayed branch and fixed branch. Both are disabled by default, and enabling either one implies basic pipelining. 4. Pressing the Run button opens the simulation window. There you can see the result of the full program execution with the Run button, or inspect the execution of each instruction in each cycle with the Next cycle and Previous cycle buttons.
ar: يلخص هذا الدليل الخطوات الأساسية لبدء العمل مع Simula3MS. 1. بعد فتح نافذة Simula3MS توجد طريقتان: • تحميل ملف تم تحريره سابقًا. • تحرير شيفرة جديدة بلغة التجميع. 2. بعد تحرير الملف أو تحميله، تكون الخطوة التالية هي تجميعه بالضغط على زر تجميع. ومن هنا توجد نتيجتان محتملتان: • إذا كانت الشيفرة خالية من الأخطاء النحوية، فسيتفعّل زر تشغيل الذي يسمح بفتح نافذة المحاكاة. • إذا لم تكن الشيفرة صحيحة، فستظهر في أسفل النافذة قائمة بكل الأخطاء وسيتم تمييز أولها. ويمكن الانتقال إلى الأخطاء التالية، إن وجدت، بواسطة زر الخطأ التالي. وبعد تصحيح هذه الأخطاء، اضغط على تجميع مرة أخرى وكرّر الخطوة 2. 3. اختر إعدادات تنفيذ الشيفرة. توجد ثلاث خيارات في قائمة الإعدادات: الإدخال/الإخراج، مسار البيانات، وتقنيات التفرع. • الإدخال/الإخراج. تكون I/O معطّلة افتراضيًا. ويمكن الاختيار بين I/O بالاستطلاع أو I/O بالمقاطعات. • مسار البيانات. الخيار المحدد افتراضيًا هو أحادي الدورة. وإذا اخترت متعدد الدورات أو أي تنفيذ بخط أنابيب، فستفتح نافذة جديدة لضبط كمون عمليات الفاصلة العائمة. • تقنيات التفرع. يتيح Simula3MS حاليًا اختيار تقنيتين للتفرع: التفرع المؤجل والتفرع الثابت. وكلتاهما معطلتان افتراضيًا، واختيار أي منهما يعني تفعيل خط أنابيب أساسي. 4. يؤدي الضغط على زر تشغيل إلى فتح نافذة المحاكاة. وفي هذه النافذة يمكن عرض نتيجة التنفيذ الكامل للبرنامج بواسطة زر تشغيل، أو متابعة تنفيذ كل تعليمة في كل دورة بواسطة زري الدورة التالية والدورة السابقة.
br: An teul-mañ a verr ar c'hammoù diazez evit kregiñ gant Simula3MS. 1. Ur wech digoret prenestr Simula3MS ez eus daou zibab: • Kargañ ur restr bet aozet a-raok. • Aozañ kod nevez e yezh an assembleur. 2. Goude bezañ aozet pe karget ar restr, ar bazenn da-heul eo he zasmblñ dre bouezañ war ar bouton Assemble. Da neuze ez eus daou zisoc'h posupl: • Ma n'eus fazi ereadur ebet er c'hod, e vo gweredekaet ar bouton Run hag e c'hallo digeriñ prenestr ar c'hefluniadur. • Ma n'eo ket reizh ar c'hod, e vo diskouezet ur roll gant an holl fazioù e traoñ ar prenestr hag ar fazi kentañ a vo lakaet war wel. Gellout a reer mont d'ar rezhioù all, ma'z int, gant ar bouton Next error. Ur wech reizhet ar fazioù-se, pouezit war Assemble en-dro ha grit adarre ar bazenn 2. 3. Dibabit kefluniadur ar seveniñ. E lañser Settings ez eus teir dibab: Input/Output, Datapath hag an teknikoù skourrañ. • Input/Output. An I/O a zo diweredekaet dre ziouer. Dibab a reer etre I/O gant pollañ pe I/O dre ziroudelloù. • Datapath. An dibab dre ziouer eo Single-cycle. Ma vez dibabet Multi-cycle pe forzh peseurt sevenadur pipeline, e tiger ur prenestr nevez evit kefluniañ dalezhioù an oberiadennoù war an niveroù flotant. • Teknikoù skourrañ. A-vremañ e c'hall Simula3MS dibab daou dechneg skourrañ: delayed branch ha fixed branch. An daou a chom diweredekaet dre ziouer, ha dibab unan anezho a dalvez pipeline diazez. 4. Dre bouezañ war ar bouton Run e vez digoret prenestr ar c'hefluniadur. Er prenestr-mañ e c'haller gwelet disoc'h seveniñ klok ar programm gant ar bouton Run, pe sellet ouzh seveniñ pep urzhiad e pep kelc'hiad gant ar boutonoù Next cycle ha Previous cycle.
cs: Tato příručka shrnuje základní kroky pro zahájení práce se Simula3MS. 1. Jakmile je okno Simula3MS otevřené, jsou dvě možnosti: • Načíst dříve upravený soubor. • Upravovat nový kód v assembleru. 2. Po úpravě nebo načtení souboru je dalším krokem jeho sestavení stisknutím tlačítka Sestavit. Odtud jsou možné dva výsledky: • Pokud kód neobsahuje syntaktické chyby, aktivuje se tlačítko Spustit, které umožní otevřít simulační okno. • Pokud kód není správný, v dolní části okna se zobrazí seznam všech chyb a první z nich bude zvýrazněna. Na další lze přecházet, pokud existují, pomocí tlačítka Další chyba. Po opravě chyb znovu stiskněte Sestavit a zopakujte krok 2. 3. Vyberte konfiguraci spuštění kódu. V nabídce Nastavení jsou tři možnosti: Vstup/Výstup, datová cesta a techniky skoků. • Vstup/Výstup. I/O je ve výchozím stavu vypnuto. Lze zvolit dotazovací I/O nebo I/O s přerušeními. • Datová cesta. Výchozí volbou je Jednocyklová. Pokud vyberete Vícecyklovou nebo jakoukoli pipeline implementaci, otevře se nové okno pro nastavení latence operací s plovoucí desetinnou čárkou. • Techniky skoků. Simula3MS aktuálně umožňuje zvolit dvě techniky skoků: zpožděný skok a pevný skok. Obě jsou ve výchozím stavu vypnuté a výběr kterékoli z nich znamená základní pipeline. 4. Stisknutím tlačítka Spustit otevřete simulační okno. V tomto okně se zobrazuje výsledek úplného běhu programu pomocí tlačítka Spustit nebo lze sledovat provádění jednotlivých instrukcí v každém cyklu pomocí tlačítek Další cyklus a Předchozí cyklus.
cy: Mae'r canllaw hwn yn crynhoi'r camau sylfaenol i ddechrau gweithio gyda Simula3MS. 1. Pan fydd ffenestr Simula3MS ar agor, mae dau opsiwn: • Llwytho ffeil sydd wedi cael ei golygu o'r blaen. • Golygu cod newydd mewn iaith gydosod. 2. Ar ôl golygu neu lwytho'r ffeil, y cam nesaf yw ei chydosod drwy wasgu'r botwm Assemble. O'r fan hon mae dau ganlyniad posibl: • Os nad oes gwallau cystrawen yn y cod, bydd y botwm Run yn cael ei alluogi ac yn caniatáu agor y ffenestr efelychu. • Os nad yw'r cod yn gywir, bydd rhestr o'r holl wallau yn ymddangos ar waelod y ffenestr a bydd y cyntaf yn cael ei amlygu. Gellir symud at y rhai canlynol, os oes rhai, gyda'r botwm Next error. Ar ôl cywiro'r gwallau hyn, pwyswch Assemble eto ac ailadroddwch gam 2. 3. Dewiswch y ffurfweddiad i redeg y cod. Mae tri opsiwn yn y ddewislen Settings: Input/Output, Datapath a thechnegau canghennu. • Input/Output. Mae I/O wedi'i analluogi yn ddiofyn. Gallwch ddewis I/O pleidleisio neu I/O seiliedig ar ymyriadau. • Datapath. Y dewis diofyn yw Single-cycle. Os dewiswch Multi-cycle neu unrhyw weithrediad wedi'i bibellu, bydd ffenestr newydd yn agor i ffurfweddu hwyrni gweithrediadau pwynt arnofiol. • Technegau canghennu. Ar hyn o bryd mae Simula3MS yn caniatáu dau dechneg ganghennu: delayed branch a fixed branch. Mae'r ddau wedi'u hanalluogi yn ddiofyn, ac mae dewis un ohonynt yn awgrymu piblinellu sylfaenol. 4. Mae pwyso'r botwm Run yn agor y ffenestr efelychu. Yn y ffenestr hon gellir gweld canlyniad gweithrediad llawn y rhaglen gyda'r botwm Run, neu weld gweithrediad pob cyfarwyddyd ym mhob cylch gyda'r botymau Next cycle a Previous cycle.
da: Denne vejledning opsummerer de grundlæggende trin for at komme i gang med Simula3MS. 1. Når Simula3MS-vinduet er åbent, er der to muligheder: • Indlæs en fil, der tidligere er blevet redigeret. • Rediger ny kode i assemblersprog. 2. Når filen er redigeret eller indlæst, er næste trin at samle den ved at trykke på knappen Sammensæt. Herfra er der to mulige resultater: • Hvis koden ikke har syntaksfejl, aktiveres knappen Kør, som giver adgang til simuleringsvinduet. • Hvis koden ikke er korrekt, vises en liste med alle fejl nederst i vinduet, og den første fremhæves. Du kan gå videre til de næste, hvis der er flere, med knappen Næste fejl. Når disse fejl er rettet, trykker du igen på Sammensæt og gentager trin 2. 3. Vælg konfigurationen til at køre koden. Der er tre muligheder i menuen Indstillinger: Input/Output, datapath og grenteknikker. • Input/Output. I/O er deaktiveret som standard. Du kan vælge mellem polling-I/O og afbrydelsesbaseret I/O. • Datapath. Standardvalget er Enkeltcyklus. Hvis du vælger Multicyklus eller en anden pipeline-implementering, åbnes et nyt vindue, hvor latenstiden for flydende komma-operationer kan konfigureres. • Grenteknikker. Simula3MS giver i øjeblikket mulighed for to grenteknikker: forsinket gren og fast gren. Begge er deaktiveret som standard, og valg af en af dem indebærer grundlæggende pipelining. 4. Ved at trykke på knappen Kør åbnes simuleringsvinduet. Her vises resultatet af programmets komplette kørsel med knappen Kør, eller du kan se udførelsen af hver instruktion i hver cyklus med knapperne Næste cyklus og Forrige cyklus.
de: Diese Anleitung fasst die grundlegenden Schritte für die Arbeit mit Simula3MS zusammen. 1. Sobald das Simula3MS-Fenster geöffnet ist, gibt es zwei Möglichkeiten: • Eine zuvor bearbeitete Datei laden. • Neuen Code in Assemblersprache bearbeiten. 2. Nachdem die Datei bearbeitet oder geladen wurde, besteht der nächste Schritt darin, sie mit der Schaltfläche Assemblieren zu assemblieren. Von hier aus gibt es zwei mögliche Ergebnisse: • Wenn der Code keine Syntaxfehler enthält, wird die Schaltfläche Ausführen aktiviert, mit der das Simulationsfenster geöffnet werden kann. • Wenn der Code nicht korrekt ist, erscheint im unteren Bereich des Fensters eine Liste aller Fehler, und der erste wird hervorgehoben. Auf die weiteren kann, falls vorhanden, mit der Schaltfläche Nächster Fehler zugegriffen werden. Nachdem die Fehler korrigiert wurden, drücken Sie erneut Assemblieren und wiederholen Schritt 2. 3. Wählen Sie die Konfiguration für die Ausführung des Codes. Im Menü Einstellungen gibt es drei mögliche Optionen: Ein/Ausgabe, Datenpfad und Sprungtechniken. • Ein/Ausgabe. Die E/A ist standardmäßig deaktiviert. Es kann zwischen Polling-E/A und interruptgesteuerter E/A gewählt werden. • Datenpfad. Die standardmäßig ausgewählte Option ist Einzyklus. Wenn Multizyklus oder eine beliebige Pipeline-Implementierung ausgewählt wird, öffnet sich ein neues Fenster zur Konfiguration der Latenz von Gleitkommaoperationen. • Sprungtechniken. Simula3MS erlaubt derzeit die Auswahl von zwei Sprungtechniken: verzögerter Sprung und fester Sprung. Beide sind standardmäßig deaktiviert, und die Auswahl einer davon setzt grundlegende Pipelining-Unterstützung voraus. 4. Durch Drücken der Schaltfläche Ausführen gelangt man zum Simulationsfenster. Dort wird das Ergebnis der vollständigen Programmausführung mit der Schaltfläche Ausführen angezeigt, oder die Ausführung jeder Instruktion in jedem Zyklus kann mit den Schaltflächen Nächster Zyklus und Vorheriger Zyklus betrachtet werden.
el: Αυτός ο οδηγός συνοψίζει τα βασικά βήματα για να αρχίσετε να εργάζεστε με το Simula3MS. 1. Μόλις ανοίξει το παράθυρο του Simula3MS, υπάρχουν δύο επιλογές: • Φόρτωση ενός αρχείου που έχει επεξεργαστεί προηγουμένως. • Επεξεργασία νέου κώδικα σε assembly. 2. Αφού επεξεργαστείτε ή φορτώσετε το αρχείο, το επόμενο βήμα είναι η συναρμολόγησή του πατώντας το κουμπί Συναρμολόγηση. Από εδώ υπάρχουν δύο πιθανά αποτελέσματα: • Αν ο κώδικας δεν έχει συντακτικά λάθη, ενεργοποιείται το κουμπί Εκτέλεση, που επιτρέπει το άνοιγμα του παραθύρου προσομοίωσης. • Αν ο κώδικας δεν είναι σωστός, στο κάτω μέρος του παραθύρου εμφανίζεται μια λίστα με όλα τα σφάλματα και το πρώτο επισημαίνεται. Μπορείτε να μεταβείτε στα επόμενα, αν υπάρχουν, με το κουμπί Επόμενο σφάλμα. Αφού διορθωθούν τα σφάλματα, πατήστε ξανά Συναρμολόγηση και επαναλάβετε το βήμα 2. 3. Επιλέξτε τη ρύθμιση για την εκτέλεση του κώδικα. Στο μενού Ρυθμίσεις υπάρχουν τρεις επιλογές: Είσοδος/Έξοδος, διαδρομή δεδομένων και τεχνικές διακλάδωσης. • Είσοδος/Έξοδος. Το I/O είναι απενεργοποιημένο από προεπιλογή. Μπορείτε να επιλέξετε I/O με polling ή I/O με διακοπές. • Διαδρομή δεδομένων. Η προεπιλεγμένη επιλογή είναι Μονοκύκλος. Αν επιλέξετε Πολυκύκλος ή οποιαδήποτε σωληνωτή υλοποίηση, ανοίγει νέο παράθυρο για τη ρύθμιση της καθυστέρησης των πράξεων κινητής υποδιαστολής. • Τεχνικές διακλάδωσης. Το Simula3MS επιτρέπει προς το παρόν δύο τεχνικές διακλάδωσης: καθυστερημένη διακλάδωση και σταθερή διακλάδωση. Και οι δύο είναι απενεργοποιημένες από προεπιλογή και η επιλογή οποιασδήποτε από αυτές συνεπάγεται βασικό pipelining. 4. Πατώντας το κουμπί Εκτέλεση ανοίγει το παράθυρο προσομοίωσης. Σε αυτό το παράθυρο εμφανίζεται το αποτέλεσμα της πλήρους εκτέλεσης του προγράμματος με το κουμπί Εκτέλεση ή μπορείτε να δείτε την εκτέλεση κάθε εντολής σε κάθε κύκλο με τα κουμπιά Επόμενος κύκλος και Προηγούμενος κύκλος.
es: Esta guía resume los pasos básicos para empezar a trabajar con Simula3MS. 1. Una vez abierta la ventana de Simula3MS, hay dos opciones: • Cargar un fichero que haya sido editado con anterioridad. • Editar un nuevo código en lenguaje ensamblador. 2. Una vez editado o cargado el fichero, el siguiente paso es ensamblarlo pulsando el botón Ensamblar. A partir de aquí hay dos posibles resultados: • Si el código no tiene errores sintácticos, se activará el botón Ejecutar, que permite acceder a la ventana de simulación. • Si el código no es correcto, en la parte inferior de la ventana aparecerá un listado con todos los errores y el primero de ellos aparecerá remarcado. Se puede acceder a los siguientes, si los hubiera, mediante el botón Error siguiente. Una vez corregidos estos fallos, se vuelve a pulsar Ensamblar y se repite el paso 2. 3. Escoger la configuración para ejecutar el código. Hay tres posibles opciones en el menú Configuración: Entrada/Salida, Camino de datos y técnicas de salto. • Entrada/Salida. La E/S aparece desactivada por defecto. Se puede escoger entre E/S con encuesta o E/S con interrupciones. • Camino de datos. La opción seleccionada por defecto es Monociclo. Si se selecciona Multiciclo o cualquier otra opción de la implementación segmentada, se abre una ventana nueva que permite configurar la latencia de las operaciones en punto flotante. • Técnicas de salto. Actualmente Simula3MS permite la selección de dos técnicas de salto: salto retardado y salto fijo. Ambas técnicas aparecen desactivadas por defecto, y la selección de cualquiera de ellas implica segmentación básica. 4. Pulsando el botón Ejecutar se accede a la ventana de simulación. En esta ventana se muestra el resultado de la ejecución completa del programa con el botón Ejecutar, o se puede ver la ejecución de cada instrucción en cada ciclo con los botones Ciclo siguiente y Ciclo anterior.
et: See juhend võtab kokku Simula3MS-iga alustamise põhietapid. 1. Kui Simula3MS-i aken on avatud, on kaks võimalust: • Laadida varem muudetud fail. • Redigeerida uut assemblerkoodi. 2. Pärast faili muutmist või laadimist on järgmine samm selle koostamine nupuga Koosta. Edasi on kaks võimalikku tulemust: • Kui koodis ei ole süntaksivigu, aktiveeritakse nupp Käivita, mis avab simulatsiooniakna. • Kui kood ei ole korrektne, ilmub akna alaossa kõigi vigade loend ja esimene neist tõstetakse esile. Järgmiste juurde saab liikuda, kui neid on, nupuga Järgmine viga. Kui vead on parandatud, vajutage uuesti Koosta ja korrake sammu 2. 3. Valige koodi käivitamise seadistus. Menüüs Seaded on kolm võimalust: Sisend/Väljund, andmetee ja harutehnikad. • Sisend/Väljund. I/O on vaikimisi keelatud. Valida saab küsitlusega I/O või katkestustega I/O. • Andmetee. Vaikimisi valitud valik on Ühetsükliline. Kui valite Mitmetsüklilise või mõne muu torustatud teostuse, avaneb uus aken ujukomaarvude operatsioonide latentsuse määramiseks. • Harutehnikad. Simula3MS võimaldab praegu valida kaks harutehnikat: viivitatud haru ja fikseeritud haru. Mõlemad on vaikimisi keelatud ning kummagi valimine tähendab põhilist torustamist. 4. Nupu Käivita vajutamisel avatakse simulatsiooniaken. Selles aknas näidatakse programmi täieliku käivitamise tulemust nupuga Käivita või saab vaadata iga käsu täitmist igas tsüklis nuppudega Järgmine tsükkel ja Eelmine tsükkel.
fa: این راهنما مراحل اصلی شروع کار با Simula3MS را خلاصه می‌کند. 1. پس از باز شدن پنجره Simula3MS دو گزینه دارید: • یک فایل ویرایش‌شده قبلی را بارگذاری کنید. • کد جدیدی به زبان اسمبلی ویرایش کنید. 2. پس از ویرایش یا بارگذاری فایل، مرحله بعدی مونتاژ آن با فشردن دکمه Assemble است. از اینجا دو نتیجه ممکن وجود دارد: • اگر کد خطای نحوی نداشته باشد، دکمه Run فعال می‌شود و می‌توانید پنجره شبیه‌سازی را باز کنید. • اگر کد درست نباشد، در پایین پنجره فهرست همه خطاها ظاهر می‌شود و اولین مورد برجسته خواهد شد. اگر خطاهای دیگری وجود داشته باشد، می‌توان با دکمه خطای بعدی به آن‌ها رفت. پس از اصلاح خطاها، دوباره Assemble را بزنید و مرحله 2 را تکرار کنید. 3. پیکربندی اجرای کد را انتخاب کنید. در منوی Settings سه گزینه وجود دارد: ورودی/خروجی، مسیر داده و روش‌های انشعاب. • ورودی/خروجی. I/O به طور پیش‌فرض غیرفعال است. می‌توانید بین I/O با polling و I/O مبتنی بر interruption انتخاب کنید. • مسیر داده. گزینه پیش‌فرض Single-cycle است. اگر Multi-cycle یا هر پیاده‌سازی پایپ‌لاین را انتخاب کنید، پنجره‌ای جدید برای تنظیم تأخیر عملیات ممیز شناور باز می‌شود. • روش‌های انشعاب. Simula3MS در حال حاضر دو روش انشعاب را اجازه می‌دهد: انشعاب تأخیری و انشعاب ثابت. هر دو به طور پیش‌فرض غیرفعال هستند و انتخاب هرکدام به معنی پایپ‌لاین پایه است. 4. با فشردن دکمه Run پنجره شبیه‌سازی باز می‌شود. در این پنجره می‌توانید نتیجه اجرای کامل برنامه را با دکمه Run ببینید، یا اجرای هر دستور را در هر چرخه با دکمه‌های چرخه بعدی و چرخه قبلی بررسی کنید.
fi: Tämä opas tiivistää Simula3MS:n käytön perusvaiheet. 1. Kun Simula3MS-ikkuna on avattu, vaihtoehtoja on kaksi: • Lataa aiemmin muokattu tiedosto. • Muokkaa uutta assembler-koodia. 2. Kun tiedosto on muokattu tai ladattu, seuraava vaihe on kääntää se painamalla Käännä-painiketta. Tästä eteenpäin on kaksi mahdollista tulosta: • Jos koodissa ei ole syntaksivirheitä, Suorita-painike aktivoituu ja avaa simulointi-ikkunan. • Jos koodi ei ole oikea, ikkunan alaosaan ilmestyy luettelo kaikista virheistä ja ensimmäinen niistä korostetaan. Seuraaviin voi siirtyä, jos niitä on, Seuraava virhe -painikkeella. Kun virheet on korjattu, paina Käännä uudelleen ja toista vaihe 2. 3. Valitse koodin suoritusasetukset. Asetukset-valikossa on kolme vaihtoehtoa: Tulo/Lähtö, datapolku ja haarautumistekniikat. • Tulo/Lähtö. I/O on oletusarvoisesti pois käytöstä. Voit valita kyselyyn perustuvan I/O:n tai keskeytyspohjaisen I/O:n. • Datapolku. Oletusvalinta on Yksisykli. Jos valitset Monisyklin tai jonkin muun putkitetun toteutuksen, avautuu uusi ikkuna, jossa voi määrittää liukulukutoimintojen latenssin. • Haarautumistekniikat. Simula3MS sallii tällä hetkellä kaksi haarautumistekniikkaa: viivästetty haara ja kiinteä haara. Molemmat ovat oletusarvoisesti pois käytöstä, ja kumman tahansa valinta merkitsee perustason liukuhihnointia. 4. Painamalla Suorita-painiketta avataan simulointi-ikkuna. Tässä ikkunassa näytetään ohjelman täydellisen suorituksen tulos Suorita-painikkeella, tai voit tarkastella jokaisen käskyn suoritusta jokaisessa syklissä painikkeilla Seuraava sykli ja Edellinen sykli.
fr: Ce guide résume les étapes de base pour commencer à travailler avec Simula3MS. 1. Une fois la fenêtre Simula3MS ouverte, deux options sont possibles : • Charger un fichier modifié auparavant. • Éditer un nouveau code en langage assembleur. 2. Une fois le fichier modifié ou chargé, l’étape suivante consiste à l’assembler en appuyant sur le bouton Assembler. À partir de là, deux résultats sont possibles : • Si le code ne comporte pas d’erreurs de syntaxe, le bouton Exécuter est activé et permet d’ouvrir la fenêtre de simulation. • Si le code n’est pas correct, une liste complète des erreurs apparaît dans la partie inférieure de la fenêtre et la première est mise en évidence. Il est possible d’accéder aux suivantes, s’il y en a, au moyen du bouton Erreur suivante. Une fois les erreurs corrigées, appuyez de nouveau sur Assembler et répétez l’étape 2. 3. Choisissez la configuration d’exécution du code. Trois options sont disponibles dans le menu Réglages : Entrée/Sortie, Chemin de données et techniques de branchement. • Entrée/Sortie. Les E/S sont désactivées par défaut. Vous pouvez choisir entre les E/S par scrutation et les E/S par interruptions. • Chemin de données. L’option sélectionnée par défaut est Monocycle. Si vous choisissez Multicycle ou une implémentation pipeline, une nouvelle fenêtre s’ouvre pour configurer la latence des opérations en virgule flottante. • Techniques de branchement. Simula3MS permet actuellement de choisir deux techniques de branchement : branchement retardé et branchement fixe. Les deux sont désactivées par défaut, et l’activation de l’une d’elles implique une segmentation de base. 4. En appuyant sur le bouton Exécuter, vous accédez à la fenêtre de simulation. Cette fenêtre affiche le résultat de l’exécution complète du programme avec le bouton Exécuter, ou permet de voir l’exécution de chaque instruction à chaque cycle avec les boutons Cycle suivant et Cycle précédent.
ga: Déanann an treoir seo achoimre ar na céimeanna bunúsacha chun tosú ag obair le Simula3MS. 1. Nuair a osclaítear fuinneog Simula3MS, tá dhá rogha ann: • Comhad a ndearnadh eagarthóireacht air roimhe seo a luchtú. • Cód nua i dteanga tionóil a chur in eagar. 2. Tar éis an comhad a chur in eagar nó a luchtú, is é an chéad chéim eile é a chur le chéile trí chnaipe Assemble a bhrú. As sin amach tá dhá thoradh fhéideartha ann: • Mura bhfuil earráidí comhréire sa chód, cuirfear an cnaipe Run ar fáil agus osclófar an fhuinneog insamhalta. • Mura bhfuil an cód ceart, taispeánfar liosta iomlán na n-earráidí ag bun na fuinneoige agus beidh an chéad cheann aibhsithe. Is féidir bogadh chuig na cinn eile, má tá a leithéid ann, leis an gcnaipe Next error. Tar éis na hearráidí a cheartú, brúigh Assemble arís agus déan céim 2 arís. 3. Roghnaigh an chumraíocht chun an cód a rith. Tá trí rogha sa roghchlár Settings: Input/Output, Datapath agus teicnící brainse. • Input/Output. Tá I/O díchumasaithe de réir réamhshocraithe. Is féidir I/O trí pholláil nó I/O bunaithe ar idirbhriseadh a roghnú. • Datapath. Is é Single-cycle an rogha réamhshocraithe. Má roghnaítear Multi-cycle nó aon chur i bhfeidhm píblínithe, osclaítear fuinneog nua chun moill oibríochtaí snámhphointe a chumrú. • Teicnící brainse. Faoi láthair ceadaíonn Simula3MS dhá theicníc brainse: delayed branch agus fixed branch. Tá an dá cheann díchumasaithe de réir réamhshocraithe, agus má roghnaítear ceann acu tugtar le fios píblíniú bunúsach. 4. Osclaíonn brú ar an gcnaipe Run an fhuinneog insamhalta. Sa fhuinneog seo is féidir toradh rith iomlán an chláir a fheiceáil leis an gcnaipe Run, nó feidhmiú gach treorach i ngach timthriall a scrúdú leis na cnaipí Next cycle agus Previous cycle.
gd: Tha an stiùireadh seo a’ toirt geàrr-chunntas air na ceumannan bunaiteach airson tòiseachadh le Simula3MS. 1. Nuair a tha uinneag Simula3MS fosgailte tha dà roghainn ann: • Luchdaich faidhle a chaidh a dheasachadh roimhe. • Deasaich còd ùr ann an cànan assembly. 2. An dèidh an fhaidhle a dheasachadh no a luchdachadh, ’s e an ath cheum a chur ri chèile le bhith a’ briogadh air a’ phutan Assemble. À seo tha dà thoradh comasach ann: • Mura h-eil mearachdan co-chàraidh sa chòd, thèid am putan Run a chur an comas agus fosglaidh e uinneag na samhlachaidh. • Mura bheil an còd ceart, nochdaidh liosta de gach mearachd aig bonn na h-uinneige agus thèid a’ chiad fhear a shoilleireachadh. Faodar gluasad gu feadhainn eile, ma tha iad ann, leis a’ phutan Next error. Às dèidh nan mearachdan a chàradh, briog air Assemble a-rithist agus dèan ceum 2 a-rithist. 3. Tagh an rèiteachadh gus an còd a ruith. Tha trì roghainnean sa chlàr Settings: Input/Output, Datapath agus dòighean geugaidh. • Input/Output. Tha I/O à comas gu bunaiteach. Faodar I/O polling no I/O stèidhichte air eadar-bhriseadh a thaghadh. • Datapath. ’S e Single-cycle an roghainn bhunaiteach. Ma thaghas tu Multi-cycle no buileachadh pìobaireachd sam bith, fosglaidh uinneag ùr airson dàil obrachaidhean puing-shnàmh a rèiteachadh. • Dòighean geugaidh. Tha Simula3MS an-dràsta a’ ceadachadh dà dhòigh geugaidh: delayed branch agus fixed branch. Tha an dà chuid à comas gu bunaiteach, agus tha taghadh gin dhiubh a’ ciallachadh pìobaireachd bhunaiteach. 4. Le briogadh air a’ phutan Run fosglaidh uinneag na samhlachaidh. San uinneig sin chì thu toradh ruith slàn a’ phrògraim leis a’ phutan Run, no chì thu ruith gach àithne anns gach cuairt leis na putanan Next cycle agus Previous cycle.
gl: Esta guía resume os pasos básicos para comezar a traballar con Simula3MS. 1. Unha vez aberta a ventá de Simula3MS, hai dúas opcións: • Cargar un ficheiro editado con anterioridade. • Editar novo código en linguaxe ensambladora. 2. Unha vez editado ou cargado o ficheiro, o seguinte paso é ensamblalo premendo o botón Ensamblar. A partir de aquí hai dous posibles resultados: • Se o código non ten erros sintácticos, activarase o botón Executar para acceder á ventá de simulación. • Se o código non é correcto, na parte inferior da ventá aparecerá a listaxe de erros e o primeiro quedará remarcado. Pódese acceder aos seguintes, se os houber, mediante o botón Error seguinte. Unha vez corrixidos, prémese de novo Ensamblar e repítese o paso 2. 3. Escoller a configuración para executar o código. Hai tres opcións no menú Configuración: Entrada/Saída, Camiño de datos e técnicas de salto. • Entrada/Saída. A E/S aparece desactivada por defecto. Pódese escoller entre E/S con enquisa ou E/S con interrupcións. • Camiño de datos. A opción por defecto é Monociclo. Se se escolle Multiciclo ou calquera opción segmentada, ábrese unha nova ventá para configurar a latencia das operacións en punto flotante. • Técnicas de salto. Simula3MS permite seleccionar salto retardado e salto fixo. Ambas técnicas aparecen desactivadas por defecto, e activar calquera delas implica segmentación básica. 4. Premendo o botón Executar accédese á ventá de simulación. Nela móstrase o resultado da execución completa do programa co botón Executar, ou pódese ver a execución de cada instrución en cada ciclo cos botóns Ciclo seguinte e Ciclo anterior.
he: מדריך זה מסכם את השלבים הבסיסיים להתחלת העבודה עם Simula3MS. 1. לאחר פתיחת חלון Simula3MS קיימות שתי אפשרויות: • לטעון קובץ שנערך בעבר. • לערוך קוד חדש בשפת אסמבלי. 2. לאחר עריכת הקובץ או טעינתו, השלב הבא הוא להרכיב אותו באמצעות לחיצה על הכפתור הרכב. מכאן יש שתי תוצאות אפשריות: • אם לקוד אין שגיאות תחביר, הכפתור הפעל יופעל ויאפשר לפתוח את חלון הסימולציה. • אם הקוד אינו תקין, בתחתית החלון תופיע רשימה של כל השגיאות והראשונה תודגש. ניתן לעבור לבאות, אם ישנן, באמצעות הכפתור שגיאה הבאה. לאחר תיקון השגיאות, לחץ שוב על הרכב וחזור על שלב 2. 3. בחר את תצורת ההרצה של הקוד. בתפריט ההגדרות יש שלוש אפשרויות: קלט/פלט, נתיב נתונים וטכניקות הסתעפות. • קלט/פלט. I/O מושבת כברירת מחדל. ניתן לבחור בין I/O בסקר לבין I/O מבוסס פסיקות. • נתיב נתונים. ברירת המחדל היא חד-מחזורי. אם בוחרים רב-מחזורי או כל יישום מצונר, נפתח חלון חדש שבו ניתן להגדיר את ההשהיה של פעולות נקודה צפה. • טכניקות הסתעפות. Simula3MS מאפשר כרגע לבחור בין שתי טכניקות הסתעפות: הסתעפות מושהית והסתעפות קבועה. שתיהן מושבתות כברירת מחדל, ובחירה באחת מהן מרמזת על צינוריות בסיסית. 4. לחיצה על הכפתור הפעל פותחת את חלון הסימולציה. בחלון זה ניתן להציג את תוצאת ההרצה המלאה של התוכנית באמצעות הכפתור הפעל, או לראות את הביצוע של כל הוראה בכל מחזור באמצעות הכפתורים המחזור הבא והמחזור הקודם.
hi: यह मार्गदर्शिका Simula3MS के साथ काम शुरू करने के मूल चरणों का सार देती है। 1. Simula3MS विंडो खुलने के बाद दो विकल्प होते हैं: • पहले से संपादित फ़ाइल लोड करें। • असेम्बली भाषा में नया कोड संपादित करें। 2. फ़ाइल को संपादित या लोड करने के बाद अगला चरण Assemble बटन दबाकर उसे assemble करना है। इसके बाद दो संभावित परिणाम होते हैं: • यदि कोड में कोई syntax error नहीं है, तो Run बटन सक्रिय हो जाएगा और simulation window खोलने देगा। • यदि कोड सही नहीं है, तो विंडो के निचले हिस्से में सभी errors की सूची दिखाई देगी और पहला error highlighted होगा। यदि और errors हों, तो Next error बटन से उन तक जाया जा सकता है। errors ठीक करने के बाद फिर से Assemble दबाएँ और चरण 2 दोहराएँ। 3. कोड चलाने के लिए configuration चुनें। Settings menu में तीन विकल्प हैं: Input/Output, Datapath और branch techniques। • Input/Output. I/O डिफ़ॉल्ट रूप से बंद रहता है। आप polling I/O या interrupt-based I/O चुन सकते हैं। • Datapath. डिफ़ॉल्ट विकल्प Single-cycle है। यदि आप Multi-cycle या कोई pipelined implementation चुनते हैं, तो floating-point operations की latency सेट करने के लिए नई window खुलती है। • Branch techniques. Simula3MS अभी दो branch techniques चुनने देता है: delayed branch और fixed branch। दोनों डिफ़ॉल्ट रूप से बंद रहती हैं, और इनमें से किसी एक को चुनने का अर्थ basic pipelining है। 4. Run बटन दबाने पर simulation window खुलती है। इस window में Run बटन से पूरे program execution का परिणाम देखा जा सकता है, या Next cycle और Previous cycle बटनों से हर instruction का हर cycle में execution देखा जा सकता है।
hr: Ovaj vodič sažima osnovne korake za početak rada sa Simula3MS-om. 1. Nakon što se otvori prozor Simula3MS-a, postoje dvije mogućnosti: • Učitati datoteku koja je već ranije uređivana. • Uređivati novi kod u asemblerskom jeziku. 2. Nakon uređivanja ili učitavanja datoteke, sljedeći korak je sastaviti je pritiskom na gumb Sastavi. Odavde postoje dva moguća ishoda: • Ako kod nema sintaktičkih pogrešaka, aktivirat će se gumb Pokreni koji omogućuje otvaranje prozora simulacije. • Ako kod nije ispravan, u donjem dijelu prozora pojavit će se popis svih pogrešaka i prva će biti označena. Sljedećima se može pristupiti, ako postoje, pomoću gumba Sljedeća pogreška. Nakon ispravljanja pogrešaka ponovno pritisnite Sastavi i ponovite korak 2. 3. Odaberite konfiguraciju za izvođenje koda. U izborniku Postavke postoje tri mogućnosti: Ulaz/Izlaz, podatkovni put i tehnike grananja. • Ulaz/Izlaz. U/I je prema zadanim postavkama isključen. Može se odabrati U/I s anketiranjem ili U/I s prekidima. • Podatkovni put. Zadana opcija je Jednociklički. Ako se odabere Višeciklički ili bilo koja cjevovodna implementacija, otvara se novi prozor za podešavanje latencije operacija s pomičnim zarezom. • Tehnike grananja. Simula3MS trenutno dopušta odabir dviju tehnika grananja: odgođeno grananje i fiksno grananje. Obje su prema zadanim postavkama isključene, a odabir bilo koje od njih podrazumijeva osnovno cjevovodno izvođenje. 4. Pritiskom na gumb Pokreni otvara se prozor simulacije. U tom se prozoru prikazuje rezultat potpunog izvođenja programa pomoću gumba Pokreni ili se može pratiti izvođenje svake instrukcije u svakom ciklusu pomoću gumba Sljedeći ciklus i Prethodni ciklus.
it: Questa guida riassume i passaggi di base per iniziare a lavorare con Simula3MS. 1. Una volta aperta la finestra di Simula3MS, ci sono due possibilità: • Caricare un file già modificato in precedenza. • Modificare nuovo codice in linguaggio assembly. 2. Dopo aver modificato o caricato il file, il passo successivo è assemblarlo premendo il pulsante Assembla. Da qui ci sono due possibili risultati: • Se il codice non contiene errori sintattici, si attiverà il pulsante Esegui, che permette di accedere alla finestra di simulazione. • Se il codice non è corretto, nella parte inferiore della finestra comparirà un elenco di tutti gli errori e il primo sarà evidenziato. È possibile accedere ai successivi, se presenti, tramite il pulsante Errore successivo. Una volta corretti questi errori, si preme di nuovo Assembla e si ripete il passo 2. 3. Scegliere la configurazione per eseguire il codice. Nel menu Impostazioni ci sono tre possibili opzioni: Input/Output, Datapath e tecniche di salto. • Input/Output. L’I/O è disattivato per impostazione predefinita. Si può scegliere tra I/O con polling e I/O con interruzioni. • Datapath. L’opzione selezionata per impostazione predefinita è Ciclo singolo. Se si seleziona Multiciclo o qualsiasi altra implementazione pipeline, si apre una nuova finestra che consente di configurare la latenza delle operazioni in virgola mobile. • Tecniche di salto. Attualmente Simula3MS consente la selezione di due tecniche di salto: salto ritardato e salto fisso. Entrambe sono disattivate per impostazione predefinita e la selezione di una di esse implica una pipeline di base. 4. Premendo il pulsante Esegui si accede alla finestra di simulazione. In questa finestra viene mostrato il risultato dell’esecuzione completa del programma con il pulsante Esegui, oppure si può vedere l’esecuzione di ogni istruzione in ogni ciclo con i pulsanti Ciclo successivo e Ciclo precedente.
ja: このガイドでは、Simula3MS を使い始めるための基本的な手順をまとめています。 1. Simula3MS のウィンドウを開くと、次の 2 つの方法があります。 • 以前に編集したファイルを読み込む。 • アセンブリ言語で新しいコードを編集する。 2. ファイルを編集または読み込んだら、次の手順は「アセンブル」ボタンを押してアセンブルすることです。ここから結果は 2 つに分かれます。 • コードに構文エラーがなければ、「実行」ボタンが有効になり、シミュレーションウィンドウを開けます。 • コードが正しくない場合は、ウィンドウ下部にすべてのエラー一覧が表示され、最初のエラーが強調表示されます。ほかにエラーがある場合は、「次のエラー」ボタンで移動できます。エラーを修正したら、再度「アセンブル」を押して手順 2 を繰り返します。 3. コードを実行するための設定を選びます。「設定」メニューには、入出力、データパス、分岐方式の 3 つの項目があります。 • 入出力。I/O は初期状態では無効です。ポーリング I/O と割り込み I/O を選べます。 • データパス。初期選択は単一サイクルです。複数サイクルやパイプライン実装を選ぶと、浮動小数点演算のレイテンシを設定する新しいウィンドウが開きます。 • 分岐方式。現在 Simula3MS では、遅延分岐と固定分岐の 2 つを選択できます。どちらも初期状態では無効で、いずれかを有効にすると基本的なパイプライン動作が前提になります。 4. 「実行」ボタンを押すとシミュレーションウィンドウが開きます。このウィンドウでは、「実行」ボタンでプログラム全体の実行結果を確認したり、「次のサイクル」「前のサイクル」ボタンで各命令の各サイクルでの実行を確認したりできます。
ko: 이 안내는 Simula3MS를 시작할 때 필요한 기본 단계를 요약합니다. 1. Simula3MS 창이 열리면 두 가지 선택지가 있습니다. • 이전에 편집한 파일을 불러옵니다. • 어셈블리 언어로 새 코드를 편집합니다. 2. 파일을 편집하거나 불러온 뒤 다음 단계는 어셈블 버튼을 눌러 조립하는 것입니다. 여기서 두 가지 결과가 나올 수 있습니다. • 코드에 문법 오류가 없으면 실행 버튼이 활성화되어 시뮬레이션 창을 열 수 있습니다. • 코드가 올바르지 않으면 창 아래쪽에 모든 오류 목록이 나타나고 첫 번째 오류가 강조 표시됩니다. 다른 오류가 있으면 다음 오류 버튼으로 이동할 수 있습니다. 오류를 수정한 뒤 다시 어셈블을 누르고 2단계를 반복합니다. 3. 코드를 실행할 구성을 선택합니다. 설정 메뉴에는 입출력, 데이터패스, 분기 기법의 세 가지 항목이 있습니다. • 입출력. I/O는 기본적으로 비활성화되어 있습니다. 폴링 I/O와 인터럽트 기반 I/O 중에서 선택할 수 있습니다. • 데이터패스. 기본 선택은 단일 사이클입니다. 다중 사이클 또는 파이프라인 구현을 선택하면 부동소수점 연산 지연 시간을 설정하는 새 창이 열립니다. • 분기 기법. 현재 Simula3MS는 지연 분기와 고정 분기 두 가지를 선택할 수 있습니다. 둘 다 기본적으로 비활성화되어 있으며, 어느 하나를 선택하면 기본적인 파이프라이닝이 적용됩니다. 4. 실행 버튼을 누르면 시뮬레이션 창이 열립니다. 이 창에서는 실행 버튼으로 프로그램 전체 실행 결과를 볼 수 있고, 다음 사이클과 이전 사이클 버튼으로 각 명령의 각 사이클 실행을 확인할 수 있습니다.
kw: An gid ma a verr an kammow diazez rag dalleth ober gans Simula3MS. 1. Pan yw fenester Simula3MS ygor, yth eus dew dewisyans: • Kargya restr a veu gwrys antergans a-rag. • Chanjya kod nowydh yn taves asemble. 2. Wosa chanjya po kargya an restr, an kamm a-dheworter yw y asemble dre waskya war an bouton Assemble. Dhe'n poent ma yth eus dew sewyans possybyl: • Mar nag eus gwall cystrawenn er kod, y fe gewerhes an bouton Run hag y c'hell ygeri fenester an simulyans. • Mar nyns yw an kod ewn, y fydh roll an holl wallow yn imbal an fenester hag an kensa y fydh war wel. Gellir mos dhe'n re arall, mar yth yn, dre'n bouton Next error. Wosa ewnhe an wallow ma, gwra waskya war Assemble arta ha kewsel an kamm 2 adarre. 3. Dewis an keflynyans rag redya an kod. Yn menu Settings yth eus tri dewisyans: Input/Output, Datapath ha technekow branchya. • Input/Output. I/O a yw diweredhek dre ziouer. Gellir dewisyans I/O dre pollans po I/O dre interruptyons. • Datapath. An dewisyans dre ziouer yw Single-cycle. Mar dewisywch Multi-cycle po nebes darparyans pipeline, y fe ygerys fenester nowydh rag settya an daleans a oberiadow poynt fliues. • Technekow branchya. Dhyworth brema y kanner dewisyans dew deknik branchya yn Simula3MS: delayed branch ha fixed branch. An dew a yw diweredhek dre ziouer, ha dewisyans unnva a dalv pipeline diazez. 4. Dre waskya war an bouton Run y fe ygerys fenester an simulyans. Yn fenester ma y haller gweles disoc'h redyans leun an programm dre'n bouton Run, po gweles redyans pub gorhemmyn yn pub kylgh dre'n boutonoù Next cycle ha Previous cycle.
lt: Šis vadovas apibendrina pagrindinius žingsnius, kaip pradėti dirbti su Simula3MS. 1. Atidarius Simula3MS langą, yra dvi galimybės: • Įkelti anksčiau redaguotą failą. • Redaguoti naują asemblerio kodą. 2. Redagavus arba įkėlus failą, kitas žingsnis yra jį surinkti paspaudus mygtuką Surinkti. Toliau galimi du rezultatai: • Jei kode nėra sintaksės klaidų, bus aktyvuotas mygtukas Vykdyti, leidžiantis atidaryti modeliavimo langą. • Jei kodas neteisingas, apatinėje lango dalyje atsiras visų klaidų sąrašas, o pirmoji bus paryškinta. Prie kitų, jei jų yra, galima pereiti mygtuku Kita klaida. Ištaisius klaidas, dar kartą paspauskite Surinkti ir pakartokite 2 žingsnį. 3. Pasirinkite kodo vykdymo konfigūraciją. Meniu Nustatymai yra trys galimybės: Įvestis/Išvestis, duomenų kelias ir šakų technikos. • Įvestis/Išvestis. I/O pagal numatytuosius nustatymus yra išjungtas. Galima rinktis apklausos I/O arba I/O su pertraukimais. • Duomenų kelias. Numatytasis pasirinkimas yra Vienciklis. Pasirinkus Daugiaciklį arba bet kurią konvejerinę realizaciją, atsidaro naujas langas, kuriame galima nustatyti slankiojo kablelio operacijų delsą. • Šakų technikos. Šiuo metu Simula3MS leidžia pasirinkti dvi šakų technikas: atidėtą šaką ir fiksuotą šaką. Abi pagal numatytuosius nustatymus išjungtos, o pasirinkus bet kurią iš jų įjungiamas bazinis konvejerinis vykdymas. 4. Paspaudus mygtuką Vykdyti atidaromas modeliavimo langas. Jame rodomas viso programos vykdymo rezultatas mygtuku Vykdyti, arba galima stebėti kiekvienos instrukcijos vykdymą kiekviename cikle mygtukais Kitas ciklas ir Ankstesnis ciklas.
lv: Šī rokasgrāmata apkopo pamatsoļus darbam ar Simula3MS. 1. Kad Simula3MS logs ir atvērts, ir divas iespējas: • Ielādēt failu, kas rediģēts iepriekš. • Rediģēt jaunu asemblera kodu. 2. Pēc faila rediģēšanas vai ielādēšanas nākamais solis ir to asamblēt, nospiežot pogu Asamblēt. Tālāk iespējami divi rezultāti: • Ja kodā nav sintakses kļūdu, tiks aktivizēta poga Palaist, kas ļauj atvērt simulācijas logu. • Ja kods nav pareizs, loga apakšdaļā parādīsies visu kļūdu saraksts, un pirmā būs izcelta. Pie nākamajām, ja tādas ir, var pāriet ar pogu Nākamā kļūda. Kad kļūdas ir izlabotas, vēlreiz nospiediet Asamblēt un atkārtojiet 2. soli. 3. Izvēlieties koda izpildes konfigurāciju. Izvēlnē Iestatījumi ir trīs iespējas: Ievade/Izvade, datu ceļš un atzaru tehnikas. • Ievade/Izvade. I/O pēc noklusējuma ir izslēgts. Var izvēlēties aptaujas I/O vai I/O ar pārtraukumiem. • Datu ceļš. Noklusējuma izvēle ir Viencikla. Ja izvēlaties Daudzciklu vai jebkuru cauruļvadu realizāciju, tiek atvērts jauns logs peldošā komata operāciju latentuma konfigurēšanai. • Atzaru tehnikas. Pašlaik Simula3MS ļauj izvēlēties divas atzarošanās tehnikas: aizturētu atzaru un fiksētu atzaru. Abas pēc noklusējuma ir izslēgtas, un jebkuras no tām izvēle nozīmē pamata cauruļvadu izpildi. 4. Nospiežot pogu Palaist, tiek atvērts simulācijas logs. Šajā logā redzams pilnīgas programmas izpildes rezultāts ar pogu Palaist vai arī katras instrukcijas izpilde katrā ciklā ar pogām Nākamais cikls un Iepriekšējais cikls.
nb: Denne guiden oppsummerer de grunnleggende stegene for å komme i gang med Simula3MS. 1. Når Simula3MS-vinduet er åpnet, finnes det to alternativer: • Last inn en fil som tidligere er redigert. • Rediger ny kode i assembler-språk. 2. Når filen er redigert eller lastet inn, er neste steg å assemblere den ved å trykke på knappen Assembler. Herfra er det to mulige resultater: • Hvis koden ikke har syntaksfeil, aktiveres knappen Kjør, som gir tilgang til simuleringsvinduet. • Hvis koden ikke er korrekt, vises en liste med alle feil nederst i vinduet, og den første blir markert. Du kan gå til de neste, hvis det finnes flere, med knappen Neste feil. Når disse feilene er rettet, trykker du på Assembler igjen og gjentar steg 2. 3. Velg konfigurasjonen for å kjøre koden. Det finnes tre alternativer i menyen Innstillinger: Inndata/Utdata, datapath og hoppteknikker. • Inndata/Utdata. I/O er deaktivert som standard. Du kan velge mellom polling-I/O og avbruddsbasert I/O. • Datapath. Standardvalget er Ensyklus. Hvis du velger Flersyklus eller en annen pipelinet implementering, åpnes et nytt vindu der latensen for flyttallsoperasjoner kan konfigureres. • Hoppteknikker. Simula3MS tillater for øyeblikket to hoppteknikker: forsinket hopp og fast hopp. Begge er deaktivert som standard, og valg av en av dem innebærer grunnleggende pipelining. 4. Ved å trykke på knappen Kjør åpnes simuleringsvinduet. Der vises resultatet av hele programkjøringen med knappen Kjør, eller du kan se utførelsen av hver instruksjon i hver syklus med knappene Neste syklus og Forrige syklus.
nl: Deze gids vat de basisstappen samen om met Simula3MS te beginnen. 1. Zodra het Simula3MS-venster geopend is, zijn er twee mogelijkheden: • Een bestand laden dat eerder is bewerkt. • Nieuwe code in assembleertaal bewerken. 2. Nadat het bestand is bewerkt of geladen, is de volgende stap het assembleren ervan door op de knop Assembleren te drukken. Vanaf hier zijn er twee mogelijke resultaten: • Als de code geen syntaxisfouten bevat, wordt de knop Uitvoeren geactiveerd en kun je het simulatievenster openen. • Als de code niet correct is, verschijnt onder in het venster een lijst met alle fouten en wordt de eerste gemarkeerd. Je kunt naar de volgende gaan, als die er zijn, met de knop Volgende fout. Nadat deze fouten zijn hersteld, druk je opnieuw op Assembleren en herhaal je stap 2. 3. Kies de configuratie om de code uit te voeren. Er zijn drie opties in het menu Instellingen: Invoer/Uitvoer, Datapad en sprongtechnieken. • Invoer/Uitvoer. I/O is standaard uitgeschakeld. Je kunt kiezen tussen polling-I/O en interruptgestuurde I/O. • Datapad. De standaard geselecteerde optie is Enkelcyclus. Als je Multicyclus of een andere gepipelineerde implementatie selecteert, wordt een nieuw venster geopend waarin je de latentie van floatingpointbewerkingen kunt instellen. • Sprongtechnieken. Simula3MS laat momenteel de keuze toe uit twee sprongtechnieken: vertraagde sprong en vaste sprong. Beide zijn standaard uitgeschakeld, en de keuze van een van beide impliceert basis-pipelining. 4. Door op de knop Uitvoeren te drukken, krijg je toegang tot het simulatievenster. In dit venster wordt het resultaat van de volledige uitvoering van het programma getoond met de knop Uitvoeren, of kun je de uitvoering van elke instructie in elke cyclus bekijken met de knoppen Volgende cyclus en Vorige cyclus.
pl: Ten przewodnik podsumowuje podstawowe kroki potrzebne do rozpoczęcia pracy z Simula3MS. 1. Po otwarciu okna Simula3MS dostępne są dwie możliwości: • Wczytać plik edytowany wcześniej. • Edytować nowy kod w języku asemblera. 2. Po edycji lub wczytaniu pliku następnym krokiem jest jego złożenie przez naciśnięcie przycisku Assembiluj. Od tego momentu możliwe są dwa wyniki: • Jeśli kod nie ma błędów składniowych, aktywuje się przycisk Uruchom, który pozwala otworzyć okno symulacji. • Jeśli kod nie jest poprawny, w dolnej części okna pojawi się lista wszystkich błędów, a pierwszy z nich zostanie wyróżniony. Do kolejnych można przechodzić, jeśli istnieją, przyciskiem Następny błąd. Po poprawieniu błędów należy ponownie nacisnąć Assembiluj i powtórzyć krok 2. 3. Wybierz konfigurację wykonania kodu. W menu Ustawienia dostępne są trzy opcje: Wejście/Wyjście, ścieżka danych i techniki skoków. • Wejście/Wyjście. I/O jest domyślnie wyłączone. Można wybrać I/O z odpytywaniem albo I/O z przerwaniami. • Ścieżka danych. Domyślną opcją jest Jednocyklowy. Jeśli wybierzesz Wielocyklowy lub dowolną implementację potokową, otworzy się nowe okno do konfiguracji opóźnienia operacji zmiennoprzecinkowych. • Techniki skoków. Simula3MS pozwala obecnie wybrać dwie techniki skoków: skok opóźniony i skok stały. Obie są domyślnie wyłączone, a wybór którejkolwiek z nich oznacza podstawowe potokowanie. 4. Naciśnięcie przycisku Uruchom otwiera okno symulacji. W tym oknie można zobaczyć wynik pełnego wykonania programu przyciskiem Uruchom albo śledzić wykonanie każdej instrukcji w każdym cyklu przyciskami Następny cykl i Poprzedni cykl.
pt_pt: Este guia resume os passos básicos para começar a trabalhar com o Simula3MS. 1. Depois de abrir a janela do Simula3MS, existem duas opções: • Carregar um ficheiro que tenha sido editado anteriormente. • Editar novo código em linguagem assembly. 2. Depois de editar ou carregar o ficheiro, o passo seguinte é montá-lo premindo o botão Montar. A partir daqui existem dois resultados possíveis: • Se o código não tiver erros sintáticos, o botão Executar será ativado e permitirá aceder à janela de simulação. • Se o código não estiver correto, na parte inferior da janela aparecerá uma lista com todos os erros e o primeiro ficará destacado. Pode aceder aos seguintes, se existirem, através do botão Erro seguinte. Depois de corrigir estes erros, prima novamente Montar e repita o passo 2. 3. Escolher a configuração para executar o código. Existem três opções no menu Definições: Entrada/Saída, Caminho de dados e técnicas de salto. • Entrada/Saída. A E/S aparece desativada por defeito. Pode escolher entre E/S por sondagem e E/S por interrupções. • Caminho de dados. A opção selecionada por defeito é Monociclo. Se selecionar Multiciclo ou qualquer outra implementação segmentada, abre-se uma nova janela que permite configurar a latência das operações em vírgula flutuante. • Técnicas de salto. Atualmente, o Simula3MS permite a seleção de duas técnicas de salto: salto retardado e salto fixo. Ambas aparecem desativadas por defeito, e a seleção de qualquer uma delas implica segmentação básica. 4. Premindo o botão Executar acede-se à janela de simulação. Nesta janela é mostrado o resultado da execução completa do programa com o botão Executar, ou pode ver-se a execução de cada instrução em cada ciclo com os botões Ciclo seguinte e Ciclo anterior.
ro: Acest ghid rezumă pașii de bază pentru a începe să lucrați cu Simula3MS. 1. După deschiderea ferestrei Simula3MS, există două opțiuni: • Să încărcați un fișier editat anterior. • Să editați cod nou în limbaj de asamblare. 2. După editarea sau încărcarea fișierului, următorul pas este asamblarea lui prin apăsarea butonului Asamblează. De aici sunt posibile două rezultate: • Dacă programul nu are erori de sintaxă, se activează butonul Rulează, care permite deschiderea ferestrei de simulare. • Dacă programul nu este corect, în partea de jos a ferestrei apare o listă cu toate erorile, iar prima este evidențiată. La următoarele se poate trece, dacă există, cu butonul Eroarea următoare. După corectarea acestor erori, apăsați din nou Asamblează și repetați pasul 2. 3. Alegeți configurația pentru executarea codului. În meniul Configurări există trei opțiuni: Intrare/Ieșire, cale de date și tehnici de salt. • Intrare/Ieșire. I/O este dezactivat implicit. Se poate alege între I/O prin interogare și I/O cu întreruperi. • Cale de date. Opțiunea selectată implicit este Monociclu. Dacă selectați Multiciclu sau orice altă implementare pipeline, se deschide o fereastră nouă pentru configurarea latenței operațiilor în virgulă mobilă. • Tehnici de salt. În prezent, Simula3MS permite alegerea a două tehnici de salt: salt întârziat și salt fix. Ambele sunt dezactivate implicit, iar selectarea oricăreia dintre ele implică pipelining de bază. 4. Apăsând butonul Rulează se deschide fereastra de simulare. În această fereastră este afișat rezultatul execuției complete a programului cu butonul Rulează sau poate fi urmărită execuția fiecărei instrucțiuni în fiecare ciclu cu butoanele Ciclul următor și Ciclul anterior.
sv: Den här guiden sammanfattar de grundläggande stegen för att börja arbeta med Simula3MS. 1. När Simula3MS-fönstret har öppnats finns det två alternativ: • Ladda en fil som tidigare har redigerats. • Redigera ny kod i assembler. 2. När filen har redigerats eller laddats är nästa steg att assembliera den genom att trycka på knappen Assembliera. Härifrån finns det två möjliga resultat: • Om koden inte har några syntaxfel aktiveras knappen Kör, som öppnar simuleringsfönstret. • Om koden inte är korrekt visas en lista med alla fel längst ned i fönstret och det första markeras. Du kan gå vidare till de följande, om det finns fler, med knappen Nästa fel. När felen har rättats trycker du på Assembliera igen och upprepar steg 2. 3. Välj konfigurationen för att köra koden. Det finns tre alternativ i menyn Inställningar: Inmatning/Utmatning, datapath och hopptekniker. • Inmatning/Utmatning. I/O är avstängt som standard. Du kan välja mellan polling-I/O och avbrottsbaserad I/O. • Datapath. Standardalternativet är Encykel. Om du väljer Flercykel eller någon annan pipeline-implementering öppnas ett nytt fönster där latensen för flyttalsoperationer kan ställas in. • Hopptekniker. Simula3MS tillåter för närvarande två hopptekniker: fördröjt hopp och fast hopp. Båda är avstängda som standard, och om någon av dem väljs innebär det grundläggande pipelining. 4. Genom att trycka på knappen Kör öppnas simuleringsfönstret. Där visas resultatet av programmets fullständiga körning med knappen Kör, eller så kan du se körningen av varje instruktion i varje cykel med knapparna Nästa cykel och Föregående cykel.
uk: Цей посібник стисло описує основні кроки для початку роботи з Simula3MS. 1. Після відкриття вікна Simula3MS є два варіанти: • Завантажити файл, який було відредаговано раніше. • Редагувати новий код мовою асемблера. 2. Після редагування або завантаження файла наступний крок — зібрати його, натиснувши кнопку Зібрати. Далі можливі два результати: • Якщо код не містить синтаксичних помилок, буде активовано кнопку Виконати, яка відкриває вікно симуляції. • Якщо код неправильний, у нижній частині вікна з’явиться список усіх помилок, а перша з них буде виділена. До наступних можна переходити, якщо вони є, кнопкою Наступна помилка. Після виправлення помилок знову натисніть Зібрати й повторіть крок 2. 3. Виберіть конфігурацію для виконання коду. У меню Налаштування є три варіанти: Ввід/Вивід, тракт даних і техніки переходів. • Ввід/Вивід. I/O типово вимкнено. Можна вибрати I/O з опитуванням або I/O з перериваннями. • Тракт даних. Типовим вибором є Одноцикловий. Якщо вибрати Багатоцикловий або будь-яку конвеєрну реалізацію, відкриється нове вікно для налаштування латентності операцій з плаваючою комою. • Техніки переходів. Наразі Simula3MS дозволяє вибрати дві техніки переходів: затриманий перехід і фіксований перехід. Обидві типово вимкнені, а вибір будь-якої з них означає базову конвеєризацію. 4. Натискання кнопки Виконати відкриває вікно симуляції. У цьому вікні показується результат повного виконання програми кнопкою Виконати, або можна переглядати виконання кожної інструкції в кожному циклі кнопками Наступний цикл і Попередній цикл.
zh_hans: 本指南概述了开始使用 Simula3MS 的基本步骤。 1. 打开 Simula3MS 窗口后，有两个选择： • 加载以前编辑过的文件。 • 编辑新的汇编语言代码。 2. 编辑或加载文件后，下一步是点击“汇编”按钮进行汇编。此后有两种可能的结果： • 如果代码没有语法错误，“运行”按钮会被启用，并可打开仿真窗口。 • 如果代码不正确，窗口底部会显示全部错误列表，并高亮显示第一个错误。如果还有其他错误，可以通过“下一个错误”按钮继续查看。修正这些错误后，再次点击“汇编”，然后重复第 2 步。 3. 选择运行代码的配置。在“设置”菜单中有三个选项：输入/输出、数据通路和分支技术。 • 输入/输出。I/O 默认处于禁用状态。可以选择轮询 I/O 或中断式 I/O。 • 数据通路。默认选择是单周期。如果选择多周期或任何流水线实现，将打开一个新窗口，用于配置浮点运算的延迟。 • 分支技术。目前 Simula3MS 允许选择两种分支技术：延迟分支和固定分支。两者默认均为禁用，选择其中任意一种都意味着启用基础流水线。 4. 点击“运行”按钮即可进入仿真窗口。在该窗口中，可以通过“运行”按钮查看程序完整执行的结果，也可以通过“下一个周期”和“上一个周期”按钮逐周期查看每条指令的执行情况。
